Revit 2027 API
FabricationNetworkChangeService.GetInLinePartTypes Method
 Get a set of element identifiers of fabrication part types for in-line parts.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetInLinePartTypes()
Public Function GetInLinePartTypes As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetInLinePartTypes()
member GetInLinePartTypes : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 Returns the set of element identifiers for in-line parts or an empty set if there are none.
See Also
Reference
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace